[
  {
    "id": 1,
    "name": "ARIES",
    "video": "https://www.youtube.com/embed/1voVskqaabg?si=A0wGV_KhuvNGppnj",
    "details": [
     "Location: Aries is located in the northern celestial hemisphere, bordered by the constellations Pisces to the west and Taurus to the east. It is situated along the ecliptic, making it one of the twelve zodiac constellations.",
     "Size: Aries covers an area of approximately 441 square degrees, making it the 39th largest constellation in the sky. Its distinct shape and bright stars make it easily recognizable.",
     "Alpha Arietis (Hamal): The brightest star in Aries, Hamal has an apparent magnitude of 2.00. It is located about 66 light-years from Earth and is often referred to as the 'head of the ram.' Hamal is a red giant star with a distinct orange hue.",
     "Beta Arietis (Sheratan): The second-brightest star in Aries, Sheratan has an apparent magnitude of 2.63 and is located approximately 59 light-years from Earth. It is a double star system that marks the ram's horn.",
     "Gamma Arietis (Mesarthim): This star has an apparent magnitude of 4.60 and is located around 164 light-years from Earth. It is a binary star system and also represents one of the ram's horns.",
     "Appearance: Aries is depicted as a ram, with its characteristic shape representing the ram's head and horns. The constellation's stars form a triangular pattern, symbolizing the ram's features.",
     "Asterisms: The 'Golden Triangle' is a notable asterism in Aries formed by Hamal, Sheratan, and another star in the nearby constellation of Triangulum. This asterism is easily recognizable in the night sky.",
     "Greek Mythology: In Greek mythology, Aries is associated with the ram that provided the Golden Fleece, which was sought by Jason and the Argonauts. The ram was sent by Zeus to save Phrixus and Helle, and after reaching Colchis, Phrixus sacrificed the ram and hung its fleece in a sacred grove.",
     "Babylonian Astronomy: In Babylonian culture, Aries was associated with the 'Lamb' and symbolized the beginning of the agricultural year. It was often linked to various deities of fertility and renewal.",
     "Egyptian Culture: In ancient Egyptian culture, Aries was associated with the god Amon-Ra, who was depicted as a ram. The ram symbolized power, fertility, and the sun, reflecting its significance in Egyptian mythology.",
     "Best Visibility: Aries is best viewed from October to March in the northern hemisphere and from April to September in the southern hemisphere. Its bright stars and recognizable shape make it a favorite among stargazers, especially in the spring months when it is high in the sky."
    ]
  },
  {
    "id": 2,
    "name": "TAURUS",
    "video": "https://www.youtube.com/embed/2a6eod9OiYY?si=3IdGT9Gi8GRbtNYR",
    "details": [
      "Location: Taurus is located in the northern celestial hemisphere, bordered by the constellations Aries to the west and Gemini to the east. It is situated along the ecliptic, making it one of the twelve zodiac constellations.",
      "Size: Taurus covers an area of approximately 797 square degrees, making it the 17th largest constellation in the sky. Its prominent stars and unique shape make it easily recognizable.",
      "Aldebaran (Alpha Tauri): The brightest star in Taurus, Aldebaran has an apparent magnitude of 0.85. It is an orange giant star located about 65 light-years from Earth. Aldebaran is often referred to as the 'eye of the bull' and is known for its distinct reddish hue.",
      "Beta Tauri (El Nath): The second-brightest star in Taurus, El Nath has an apparent magnitude of 1.65 and is located approximately 131 light-years from Earth. It marks the tip of the bull's horn and is a blue-white giant star.",
      "The Pleiades (M45): This well-known star cluster, also known as the 'Seven Sisters,' is located within the boundaries of Taurus. It is an open cluster that contains several bright stars, easily visible to the naked eye.",
      "Appearance: Taurus is depicted as a bull, with its prominent V-shape representing the bull's head and horns. The constellation is known for its characteristic shape, making it one of the most recognizable zodiac signs.",
      "Asterisms: The 'V' shape formed by Aldebaran and the Pleiades cluster is a notable asterism in Taurus, symbolizing the bull's head and horns.",
      "Greek Mythology: In Greek mythology, Taurus is associated with the story of Zeus, who transformed himself into a magnificent white bull to seduce Europa. Once she climbed onto his back, he swam to Crete, where he revealed his true identity.",
      "Babylonian Astronomy: In Babylonian culture, Taurus was associated with the 'Bull of Heaven' and was linked to various agricultural deities, symbolizing strength and fertility.",
      " Egyptian Culture: In ancient Egyptian culture, Taurus was associated with the bull god Apis, who was revered as a symbol of fertility, strength, and regeneration. The bull was considered a sacred creature.",
      "Best Visibility: Taurus is best viewed from November to February in the northern hemisphere and from May to August in the southern hemisphere. Its bright stars and notable deep-sky objects make it a favorite among stargazers, especially during the winter months in the northern hemisphere."
    ]
  },
  {
    "id": 3,
    "name": "GEMINI",
    "video": "https://www.youtube.com/embed/hIaV55bemoU?si=dDenqnQza2aUV3HE",
    "details": [
      " Location: Gemini is located in the northern celestial hemisphere, bordered by the constellations Taurus to the west and Cancer to the east. It is situated along the ecliptic, making it one of the twelve zodiac constellations.",
      "Size: Gemini covers an area of approximately 514 square degrees, making it the 30th largest constellation in the sky. Its bright stars and recognizable shape make it easily identifiable.",
      "Castor (Alpha Geminorum): The brightest star in Gemini, Castor has an apparent magnitude of 1.58. It is a complex multiple star system located about 51 light-years from Earth. Castor is often referred to as one of the 'twins' and has a distinct white color.",
      "Pollux (Beta Geminorum): The second-brightest star in Gemini, Pollux has an apparent magnitude of 1.14. It is located approximately 34 light-years from Earth and is a red giant star. Pollux is often associated with strength and represents the other 'twin.'",
      "Gamma Geminorum (Alhena): This star has an apparent magnitude of 1.93 and is located around 105 light-years from Earth. It is a bright A-type star that represents the foot of one of the twins.",
      "Appearance: Gemini is depicted as two 'twins,' Castor and Pollux, standing side by side. The constellation has a distinctive shape formed by its two bright stars and several other fainter stars that outline the twins.",
      "Asterisms: The 'Twin Stars' (Castor and Pollux) are the most recognized asterism in Gemini, symbolizing the bond between the two twins. Together, they form a prominent part of the night sky.",
      "Greek Mythology: In Greek mythology, Gemini represents the twins Castor and Pollux, the sons of Leda and Zeus. Castor was a mortal, while Pollux was immortal, and they were known for their close bond and adventures together. When Castor died, Pollux begged Zeus to allow them to be together, leading to their placement among the stars.",
      "Babylonian Astronomy: In Babylonian astronomy, Gemini was associated with the ‘Twin Heroes’ and symbolized the duality of life and the connection between mortals and the divine.",
      "Egyptian Culture: In ancient Egyptian culture, Gemini was linked to the concept of duality and the balance of opposites, often representing the dual nature of existence and the relationship between the divine and the mortal realms.",
      "Best Visibility: Gemini is best viewed from December to March in the northern hemisphere and from June to September in the southern hemisphere. Its bright stars, especially Castor and Pollux, make it a favorite among stargazers during the winter months in the northern hemisphere."
    ]
  },
  {
    "id": 4,
    "name": "CANCER", 
    "video": "https://www.youtube.com/embed/oMQCYhf3HeY?si=vk2a5UImGKbH0Qku",
    "details": [
      "Location: Cancer is located in the northern celestial hemisphere, bordered by the constellations Gemini to the west and Leo to the east. It is situated along the ecliptic, making it one of the twelve zodiac constellations.",
      "Size: Cancer covers an area of approximately 506 square degrees, making it the 31st largest constellation in the sky. Despite its relatively small size, it contains several notable deep-sky objects.",
      "Beta Cancri (Altarf): The brightest star in Cancer, Beta Cancri, has an apparent magnitude of 3.50. It is a red giant star located about 290 light-years from Earth and is often referred to as 'Altarf'.",
      "Acubens (Alpha Cancri): Another significant star in Cancer, Acubens has an apparent magnitude of 4.25 and is located approximately 174 light-years away. It is a binary star system and represents the 'claw' of the crab.",
      "Gamma Cancri (Asellus Australis): This star has an apparent magnitude of 4.00 and is located around 160 light-years from Earth. It represents the southern ass (donkey) that was part of the crab’s mythological story.",
      "Appearance: Cancer is depicted as a crab, although its stars are faint and can be challenging to discern. The constellation has a somewhat irregular shape, with stars forming a 'Y' or 'V' pattern that symbolizes the crab's claws.",
      "Asterisms: The 'Beehive Cluster' (M44) is a notable open star cluster located in Cancer, easily visible to the naked eye. This cluster has been recognized since ancient times and is often considered one of the best examples of a star cluster in the night sky.",
      "Greek Mythology: In Greek mythology, Cancer is associated with the giant crab sent by the goddess Hera to distract Heracles (Hercules) during his battle with the Lernaean Hydra. The crab was ultimately crushed by Heracles, and in honor of its efforts, Hera placed it among the stars.",
      "Babylonian Astronomy: In Babylonian culture, Cancer was identified as the 'Crab' and associated with the agricultural calendar, marking the time for planting crops due to its positioning along the ecliptic.",
      "Egyptian Culture: In ancient Egyptian mythology, Cancer was linked to the flooding of the Nile River, which was seen as a life-giving force. The constellation represented the cyclical nature of life and rebirth.",
      "Best Visibility: Cancer is best viewed from January to March in the northern hemisphere and from July to September in the southern hemisphere. Its position along the ecliptic allows it to be seen during the zodiac season, although its stars are relatively faint compared to other zodiac constellations."
    ]
  },
  {
    "id": 5,
    "name": "LEO",
    "video": "https://www.youtube.com/embed/9byGhIMqAYw?si=fJ2s3bzZO1fpmtJj",
    "details": [
      "Location: Leo is located in the northern celestial hemisphere, bordered by the constellations Cancer to the west and Virgo to the east. It is situated along the ecliptic, making it one of the twelve zodiac constellations.",
      "Size: Leo covers an area of approximately 947 square degrees, making it the 12th largest constellation in the sky. Its distinctive shape resembles a lion, making it easily recognizable.",
      "Regulus (Alpha Leonis): The brightest star in Leo, Regulus has an apparent magnitude of 1.35. It is a multiple star system located about 79 light-years from Earth. Regulus is often referred to as the 'heart of the lion' and is notable for its blue-white hue.",
      "Denebola (Beta Leonis): The second-brightest star in Leo, Denebola has an apparent magnitude of 2.14 and is located approximately 36 light-years from Earth. It represents the lion's tail and is a white star.",
      "Gamma Leonis (Algieba): Another significant star, Algieba is a binary star system with an apparent magnitude of 3.54, located around 125 light-years from Earth. It is known for its golden-yellow color and is part of the lion's mane.",
      "Appearance: Leo is depicted as a lion, with its characteristic mane and outstretched body. The pattern of stars forms a distinctive shape, representing the lion's head and forelegs.",
      " Asterisms: The 'Sickle of Leo' is a prominent asterism that forms the lion's head and mane. This shape consists of a group of stars that create a sickle-like pattern, making it easy to spot.",
      "Greek Mythology: In Greek mythology, Leo is associated with the Nemean Lion, a monstrous creature that was defeated by the hero Heracles (Hercules) as one of his Twelve Labors. The lion's impenetrable skin became a symbol of strength and bravery.",
      "Babylonian Astronomy: In Babylonian times, Leo was associated with the 'Lion of the Sky' and was often depicted in celestial maps. It was seen as a powerful symbol of kingship and authority.",
      "Egyptian Culture: In ancient Egyptian culture, Leo was associated with the goddess Sekhmet, who was depicted as a lioness. Sekhmet was the goddess of war and healing, representing both destruction and protection.",
      "Best Visibility: Leo is best viewed from January to May in the northern hemisphere and from July to October in the southern hemisphere. Its bright stars and distinctive shape make it a favorite among stargazers, particularly in spring when it is high in the sky."
    ]
  },
  {
    "id": 6,
    "name": "VIRGO",
    "video": "https://www.youtube.com/embed/OsgXa0HquWo?si=_hyeLH6-vsPfZFMO",
    "details": [
      "Location: Virgo is located in the northern celestial hemisphere, bordered by the constellations Libra to the west and Leo to the east. It lies along the ecliptic, making it one of the twelve zodiac constellations.",
      "Size: Virgo is the second-largest constellation in the sky, covering an area of approximately 1,294 square degrees. Its large size makes it one of the most easily recognizable constellations.",
      "Spica (Alpha Virginis): The brightest star in Virgo, Spica has an apparent magnitude of 1.04. It is a blue giant located about 250 light-years from Earth. Spica is a binary star system and is often seen as representing the ear of wheat held by the maiden in Virgo.",
      "Porrima (Gamma Virginis): The second-brightest star in Virgo, Porrima has a magnitude of about 2.74 and is located around 38 light-years from Earth. It is a binary star named after the Roman goddess of prophecy.",
      "Zavijava (Beta Virginis): Another notable star, Zavijava has an apparent magnitude of 3.61 and is located approximately 36 light-years from Earth. It marks the head of the maiden.",
      "Appearance: Virgo is depicted as a maiden holding a sheaf of wheat, symbolizing fertility and the harvest. Its shape is elongated, stretching across a significant portion of the sky.",
      "Asterisms: Spica, along with a few other stars, forms the most recognizable part of Virgo, representing the sheaf of wheat. Virgo’s stars, though not exceptionally bright, are spread out, giving the constellation a distinctive appearance.",
      "Greek Mythology: Virgo is often associated with Demeter, the Greek goddess of agriculture, or her daughter Persephone. The constellation symbolizes the maiden’s role in nurturing the earth and the changing seasons as Persephone descends to and returns from the underworld.",
      "Babylonian Astronomy: In Babylonian culture, Virgo was linked to the goddess Shala, who was associated with fertility and grain. The constellation symbolized the bountiful harvest.",
      "Egyptian Culture: In ancient Egypt, Virgo was identified with the goddess Isis, who was revered for her protective and nurturing qualities. Virgo's rising in the sky signaled the start of the harvest season in Egypt.",
      "Best Visibility: Virgo is best viewed from April to May in the northern hemisphere and from September to October in the southern hemisphere. As one of the largest constellations, it is easily visible to the naked eye, particularly during spring in the northern hemisphere, when it reaches its highest point in the sky."
    ]
  },
  {
    "id": 7,
    "name": "LIBRA",
    "video": "https://www.youtube.com/embed/IeNW0qIIBOU?si=c19wp4VA9kdBhJWV",
    "details": [
      "Location: Libra is located in the southern celestial hemisphere, between the constellations Virgo to the west and Scorpius to the east. It lies along the ecliptic, making it one of the twelve zodiac constellations.",
      "Size: Libra covers an area of approximately 538 square degrees, making it the 29th largest constellation in the sky. It is relatively faint but distinguishable by its quadrilateral shape.",
      "Zubenelgenubi (Alpha Librae): The brightest star in Libra, Zubenelgenubi has an apparent magnitude of 2.75. It is a multiple star system located about 77 light-years from Earth. Its name means 'southern claw', as it was once part of the Scorpius constellation.",
      "Zubeneschamali (Beta Librae): The second-brightest star in Libra, with an apparent magnitude of 2.61. Zubeneschamali is a blue dwarf star located about 185 light-years from Earth. Its name means 'northern claw', also reflecting its historical connection to Scorpius.",
      " Gamma Librae: Another notable star in Libra, Gamma Librae has an apparent magnitude of 3.91 and is located around 152 light-years away from Earth. It marks the bottom of the 'scales'.",
      "Appearance: Libra is symbolized as a pair of scales, the only zodiac constellation represented by an inanimate object. Its four main stars form a quadrilateral shape, representing the balancing scales.",
      "Asterisms: The quadrilateral pattern of stars in Libra is its most prominent feature, representing the scales’ two pans. Although faint, this shape helps in identifying the constellation.",
      "Greek Mythology: In Greek mythology, Libra is associated with the goddess Themis, the personification of divine order and justice. The scales symbolize fairness and balance. In Roman times, Libra was linked to Astraea, the goddess of justice, often depicted holding the scales.",
      "Babylonian Astronomy: The Babylonians associated Libra with balance and justice, seeing it as a symbol of fairness. It was originally considered part of Scorpius before being recognized as a separate constellation representing the scales.",
      "Egyptian Culture: In ancient Egyptian mythology, Libra was connected to the weighing of souls, where the heart of the deceased was weighed against a feather to determine their fate in the afterlife.",
      "Best Visibility: Libra is best viewed from June to July in the northern hemisphere and from March to April in the southern hemisphere. Though not the brightest, its position along the ecliptic makes it easier to locate for those familiar with the zodiac constellations."
    ]
  },
  {
    "id": 8,
    "name": "SCORPIUS",
    "video": "https://www.youtube.com/embed/Cg_xDGbNqss?si=W2RLo_nqTRgiZINV",
    "details": [
      "Location: Scorpius is located in the southern celestial hemisphere, positioned between the constellations Libra to the north and Sagittarius to the south.",
      "Size: It covers an area of approximately 497 square degrees, making it the 33rd largest constellation in the sky. Its prominent shape makes it easily recognizable.",
      "Antares: The brightest star in Scorpius, Antares, is a red supergiant with an apparent magnitude of about 1.0, making it one of the brightest stars in the night sky. It is approximately 550 light-years from Earth. Antares is often referred to as the 'heart of the scorpion' and has a distinct reddish hue.",
      "Shaula (Lambda Scorpii): This star is the second brightest in the constellation, with a magnitude of about 1.6. Shaula is located approximately 700 light-years away and is notable for being part of the scorpion's tail.",
      "Lesath (Upsilon Scorpii): Another significant star, Lesath has a magnitude of about 2.6 and is located around 500 light-years from Earth. It marks the tip of the scorpion's tail.",
      "Appearance: Scorpius is known for its distinctive shape that resembles a scorpion. The curved tail and pincers are its most recognizable features.",
      "Asterisms: The constellation includes prominent asterisms that depict the scorpion's body and tail.",
      "Greek Mythology: Scorpius is associated with the myth of Orion, the great hunter. According to legend, the scorpion was sent by the goddess Gaia to kill Orion, and as a result, they are positioned in such a way that they never appear in the sky simultaneously.",
      "Babylonian Astronomy: The Babylonians identified Scorpius as the 'Scorpion' and associated it with various deities of war and strength.",
      "Egyptian Culture: In ancient Egypt, Scorpius was seen as a representation of protection and was linked to the goddess Serqet, who protected the dead from venomous creatures.",
      "Best Visibility: Scorpius is best viewed in the evening sky from May to September in the northern hemisphere and from November to February in the southern hemisphere. It is prominently placed in the Milky Way, making it a favorite among stargazers."
    ]
  },
  {
    "id": 9,
    "name": "SAGITTARIUS",
    "video": "https://www.youtube.com/embed/bIhceKZDOF4?si=CwN3w6EMFlkTrfuT",
    "details": [
      "Location: Sagittarius is located in the southern celestial hemisphere, between the constellations Scorpius to the west and Capricornus to the east. It is also near the center of the Milky Way, allowing observation of many deep-sky objects.",
      "Size: Sagittarius covers an area of approximately 867 square degrees, making it the 15th largest constellation in the sky.",
      "Kaus Australis (Epsilon Sagittarii): The brightest star in the constellation, with an apparent magnitude of 1.85. Kaus Australis is located about 143 light-years from Earth and is part of the 'bow' of the archer.",
      "Nunki (Sigma Sagittarii): The second-brightest star, with an apparent magnitude of about 2.02. Nunki is a blue giant star located around 225 light-years from Earth and is one of the brightest stars in the Milky Way.",
      "Kaus Media (Delta Sagittarii): The third-brightest star with an apparent magnitude of 2.72, located in the middle part of the bow.",
      "Sagittarius A*: The center of the Milky Way contains a supermassive black hole called Sagittarius A*, located about 26,000 light-years from us. This is one of the most important objects in modern astronomical research.",
      "Appearance: Sagittarius is often depicted as a centaur (half-man, half-horse) shooting a bow and arrow. Its distinctive shape is known as the 'Teapot', a recognizable asterism formed by stars resembling a teapot on the sky.",
      "Asterisms: The 'Teapot' is one of the most prominent star groups within Sagittarius. The teapot's handle is formed by the stars Kaus Borealis, Kaus Media, and Kaus Australis.",
      "Greek Mythology: In Greek mythology, Sagittarius is often associated with Chiron, a wise and benevolent centaur. Chiron was known for his knowledge of medicine and music, differing from other centaurs who were typically wild and violent.",
      "Babylonian Astronomy: The ancient Babylonians regarded Sagittarius as a protector of warriors, referring to it as 'Pabilsag', symbolizing strength and victory.",
      "Egyptian Culture: In ancient Egyptian culture, Sagittarius was linked to the god Serqet, a deity who protected the souls of the dead from venomous creatures.",
      "Best Visibility: Sagittarius is best observed from July to September in the northern hemisphere, and from November to February in the southern hemisphere. The constellation is prominently placed along the Milky Way, making it a favorite among stargazers."
    ]
  },
  {
    "id": 10,
    "name": "CAPRICORN",
    "video": "https://www.youtube.com/embed/sMe9-H0-Mw8?si=C9_1a21OJGkxeMjd",
    "details": [
      "Location: Capricornus is located in the southern celestial hemisphere, between the constellations Sagittarius to the west and Aquarius to the east. It is positioned along the ecliptic, making it one of the twelve zodiac constellations.",
      "Size: Capricornus covers an area of approximately 414 square degrees, making it the 40th largest constellation in the sky. Although relatively faint, its triangular shape is recognizable.",
      "Deneb Algedi (Delta Capricorni): The brightest star in Capricornus, Deneb Algedi has an apparent magnitude of 2.85. It is a multiple star system located around 39 light-years from Earth and is part of the 'tail' of the goat.",
      " Nashira (Gamma Capricorni): The second-brightest star with a magnitude of about 3.69. Nashira is a giant star located around 139 light-years from Earth, known as the 'bearer of good news'.",
      "Dabih (Beta Capricorni): Another notable star in the constellation, Dabih is a double star system with an apparent magnitude of 3.05, located approximately 340 light-years from Earth.",
      " Appearance: Capricornus is often depicted as a sea-goat, a creature with the head and front legs of a goat and the tail of a fish. Its distinctive triangular or 'V' shape forms the body of the sea-goat.",
      " Asterisms: The triangular arrangement of stars within Capricornus forms the most recognizable pattern, symbolizing the body of the sea-goat. This makes it easier to identify in the night sky despite its faintness.",
      "Greek Mythology: In Greek mythology, Capricornus is associated with the god Pan, who transformed himself into a sea-goat to escape the monster Typhon. The constellation symbolizes Pan's escape and his role as a protector.",
      "Babylonian Astronomy: The ancient Babylonians called this constellation 'the Goat-Fish', and it represented the god Enki, a deity of water, knowledge, and creation.",
      "Egyptian Culture: In ancient Egyptian culture, Capricornus was associated with the Nile’s seasonal floods and fertility, as the appearance of the constellation in the sky coincided with the annual flooding.",
      "Best Visibility: Capricornus is best viewed from August to October in the northern hemisphere and from January to March in the southern hemisphere. While faint, it is located along the ecliptic, making it easier to find for those familiar with zodiac constellations."
    ]
  },
  {
    "id": 11,
    "name": "AQUARIUS",
    "video": "https://www.youtube.com/embed/ZoVnKt_fvDk?si=2W-1JKUbXm9AoJeT",
    "details": [
      "Location: Aquarius is located in the southern celestial hemisphere, bordered by the constellations Capricornus to the west and Pisces to the east. It lies along the ecliptic, making it one of the twelve zodiac constellations.",
      "Size: Aquarius covers an area of approximately 980 square degrees, making it the 10th largest constellation in the sky. Despite its size, it is composed mainly of faint stars.",
      "Sadalsuud (Beta Aquarii): The brightest star in Aquarius, Sadalsuud, has an apparent magnitude of 2.87. It is a yellow supergiant star located about 540 light-years from Earth.",
      "Sadalmelik (Alpha Aquarii): The second-brightest star with an apparent magnitude of 2.94. Sadalmelik is a supergiant star located approximately 760 light-years from Earth and forms part of the water-bearer’s shoulder.",
      "Skat (Delta Aquarii): Another notable star, Skat has an apparent magnitude of 3.27 and is located about 160 light-years from Earth. It marks the leg of the water-bearer.",
      "Appearance: Aquarius is depicted as a water-bearer pouring water from a jar. The constellation is represented by a zigzagging line of stars symbolizing water flowing from the jar.",
      "Asterisms: The 'Water Jar' asterism is formed by a Y-shaped arrangement of stars near the center of Aquarius, representing the jar from which water flows. This is the most identifiable feature of the constellation.",
      "Greek Mythology: In Greek mythology, Aquarius is often associated with Ganymede, a beautiful young boy who was taken to Mount Olympus to serve as the cupbearer to the gods. The pouring water symbolizes Ganymede’s role as the bringer of rain and sustenance.",
      "Babylonian Astronomy: The Babylonians identified Aquarius as 'the Great One' and associated it with the god Ea (Enki), the god of water and creation, who poured life-giving water from a vessel.",
      "Egyptian Culture: In ancient Egypt, Aquarius was linked to the annual flooding of the Nile River, which brought fertility to the land. The water-bearer was seen as a symbol of abundance and life.",
      "Best Visibility: Aquarius is best viewed from October to November in the northern hemisphere and from April to May in the southern hemisphere. Despite its faint stars, it can be identified by locating the 'Water Jar' asterism near the ecliptic."
    ]
  },
  {
    "id": 12,
    "name": "PISCES",
    "video": "https://www.youtube.com/embed/tSgtBul5eng?si=tv-piCLLekfL2AS6",
    "details": [
      "Location: Pisces is located in the northern celestial hemisphere, between Aquarius to the west and Aries to the east. It lies along the ecliptic, making it one of the twelve zodiac constellations.",
      "Size: Pisces covers an area of approximately 889 square degrees, making it the 14th largest constellation in the sky. Despite its size, it is made up of relatively faint stars.",
      "Alrescha (Alpha Piscium): The brightest star in Pisces, Alrescha, has an apparent magnitude of 3.82. It is a binary star system located about 139 light-years from Earth and is situated at the point where the two fish of Pisces are connected by a 'rope'.",
      "Fumalsamakah (Beta Piscium): The second-brightest star with an apparent magnitude of 4.53. Fumalsamakah is located around 492 light-years from Earth and is part of the western fish’s body.",
      "Eta Piscium: Another notable star, Eta Piscium has an apparent magnitude of 3.62, making it the actual brightest star in the constellation, though not traditionally designated as Alpha. It is located about 294 light-years from Earth and marks the head of the western fish.",
      "Appearance: Pisces is depicted as two fish tied together by a long, looping ribbon. The fish swim in opposite directions, symbolizing the duality and interconnection of their nature.",
      "Asterisms: The 'Circlet' asterism is a small group of stars that forms the head of the western fish. This circular pattern is one of the few identifiable features in this faint constellation.",
      "Greek Mythology: In Greek mythology, Pisces represents the fish into which the goddess Aphrodite and her son Eros transformed to escape the monster Typhon. The two fish are bound together to symbolize their unity during their escape.",
      "Babylonian Astronomy: In ancient Babylonian astronomy, Pisces was associated with the rivers Tigris and Euphrates and symbolized fertility and the life-giving properties of water.",
      "Egyptian Culture: In ancient Egypt, Pisces was associated with the Nile and its fish, which were seen as symbols of life and abundance due to the river’s vital role in sustaining agriculture.",
      "Best Visibility: Pisces is best viewed from November to December in the northern hemisphere and from March to April in the southern hemisphere. Although its stars are faint, the 'Circlet' asterism can be a helpful guide for locating it."
    ]
  }
]
